app/views/classrooms/_form.html.erb

  	<%= f.label :building_id, class: "control-label" %>
		<%= f.select "building_id", options_for_select(Building.all.order('name').collect{ |b| [b.name, b.id] }, @classroom.building_id), class: "form-control" %>
---
SELECT "buildings".* FROM "buildings"  ORDER BY name