app/views/classrooms/index.html.erb

SELECT "buildings".* FROM "buildings"  ORDER BY name
---
												<p><strong>Building</strong></p>
												<%= f.select "building_id_eq", options_for_select(Building.all.order('name').collect{ |b| [b.name, b.id] }), :include_blank => "Any" %>

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."classroom_id" = ?  ORDER BY "pictures"."id" ASC LIMIT 1  [["classroom_id", 1]]
---
									</div>
								<% if classroom.pictures.first.nil? %>