app/views/classrooms/show.html.erb

SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT 1  [["id", 3]]
---
												<td>
											  	<%= Building.find(@classroom.building_id).name %>