app/views/buildings/index.html.erb

																<td>
																				<% building.classrooms.each do |classroom| %>
---
SELECT "classrooms".* FROM "classrooms" WHERE "classrooms"."building_id" = ?  [["building_id", "1"]]