app/controllers/buildings_controller.rb

SELECT "buildings".* FROM "buildings"  ORDER BY name
---
	def index
		@buildings = Building.all.order('name')

INSERT INTO "buildings" ("name", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Lampros Hall"], ["code", "LP"], ["created_at", "2015-08-13 23:52:39.340192"], ["updated_at", "2015-08-13 23:52:39.340192"]]
---
	def create
		@building = Building.new(building_params)

    respond_to do |format|
      if @building.save