app/controllers/classrooms_controller.rb

SELECT "classrooms".* FROM "classrooms"  ORDER BY name
---
  def index
    @search = Classroom.search(params[:q])

SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = ? LIMIT 1  [["id", 1]]
SELECT "pictures".* FROM "pictures" WHERE "pictures"."classroom_id" = ?  [[nil, 2]]
---
  def show
		@classroom = Classroom.find(params[:id])
		@pictures = @classroom.pictures
		@contact = @classroom.contact_id? ? Contact.find(@classroom.contact_id) : nil

SELECT "buildings".* FROM "buildings"  ORDER BY name
---
  def new
    @classroom = Classroom.new
		@buildings = Building.all

INSERT INTO "classrooms" ("name", "building_id", "occupancy", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "LL125"], ["building_id", "Lind Lecture"], ["occupancy", 50], ["created_at", "2015-07-29 22:22:14.963421"], ["updated_at", "2015-07-29 22:22:14.963421"]]
---
  def create
    @classroom = Classroom.new(classroom_params)

    respond_to do |format|
      if @classroom.save

UPDATE "classrooms" SET "building_id" = ?, "smartboard" = ?, "pc" = ?, "doccam" = ?, "updated_at" = ? WHERE "classrooms"."id" = ?  [["building_id", "3"], ["smartboard", "f"], ["pc", "t"], ["doccam", "f"], ["updated_at", "2015-08-18 23:01:41.456749"], ["id", 12]]
---
  def update
    respond_to do |format|
      if @classroom.update(classroom_params)

DELETE FROM "classrooms" WHERE "classrooms"."id" = ?  [["id", 1]]
---
  def destroy
    @classroom.destroy

SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = ? LIMIT 1  [["id", 6]]
---
    def set_classroom
      @classroom = Classroom.find(params[:id])