app/controllers/pictures_controller.rb

SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."classroom_id" = ?  ORDER BY "pictures"."id" DESC LIMIT 1  [["classroom_id", 7]]
SELECT COUNT(*) FROM "pictures" WHERE "pictures"."classroom_id" = ?  [["classroom_id", 8]]
INSERT INTO "pictures" ("name", "image", "classroom_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "LL_125_1"], ["image", "LL125_1.jpeg"], ["classroom_id", 4], ["created_at", "2015-07-29 23:34:19.585080"], ["updated_at", "2015-07-29 23:34:19.585080"]]
---
  def create
    @picture = Picture.new(picture_params)
		@classroom = Classroom.find(@picture.classroom_id)
		if @classroom.pictures.count == 0
			@new_id = 1
		else
			@new_id = @classroom.pictures.last.id
		end
		@new_id += 1
		@picture.name = @classroom.name + "_"  + @new_id.to_s

    respond_to do |format|
      if @picture.save

UPDATE "pictures" SET "name" = ?, "updated_at" = ? WHERE "pictures"."id" = ?  [["name", "BC_117"], ["updated_at", "2015-08-14 20:51:31.740855"], ["id", 9]]
---
  def update
    respond_to do |format|
      if @picture.update(picture_params)

SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 2]]
---
  def destroy
    @classroom = Classroom.find(@picture.classroom_id)
		@picture.destroy