app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "Matt@ninja.dev"]]
---
	def create
		@user = User.find_by_email(params[:session][:email].downcase)